/*
*********************************************************************************************************
*
*	模块名称 : 旋转编码器驱动模块
*	文件名称 : bsp_encoder.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2010-2011, 武汉汉升汽车传感系统有限责任公司
*
*********************************************************************************************************
*/

#ifndef __BSP_ENCODER_H
#define __BSP_ENCODER_H


/* 定义旋转编码器键值代码(要保证和普通按键的键值代码不重叠) */
enum
{
	KEY_INC = 100,			/* 顺时针-1键 */
	KEY_DEC					/* 逆时针+1键 */
};

/* 供外部调用的函数声明 */
void bsp_InitEncoder(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/